david15711/STM32workplace/Exp22_4_Omok_16x16.c
/* ============================================================================ */
/*		Exp18_4_Omok_16x16.c : 16 x 16 라인 오목 게임			*/
/* ============================================================================ */
/*					Programmed by Duck-Yong Yoon in 2016.   */

#include "stm32f767xx.h"
#include "OK-STM767.h"

void SysTick_Handler(void);			// SysTick interrupt function by 2Hz
unsigned char Icon_input(void);			// input touch screen icon
void Initialize_board(void);			// initialize board
void Draw_symbol(U08 xPos,U08 yPos, U16 color, U08 code); // draw cross of bopard
void Draw_board(void);				// draw board
void Draw_control(void);			// draw game control
void Draw_cleargame(U16 color1, U16 color2);	// display clear game for touch screen
void Draw_left(U16 color1, U16 color2);		// display left arrow for touch screen
void Draw_right(U16 color1, U16 color2);	// display right arrow for touch screen
void Draw_up(U16 color1, U16 color2);		// display up arrow for touch screen
void Draw_down(U16 color1, U16 color2);		// display down arrow for touch screen
void Draw_enter(U16 color1, U16 color2);	// display stone enter for touch screen
void Draw_arrow(U16 xPos,U16 yPos,U16 color,U08 code);	  // draw arrow for touch screen

void Omok_game(void);				// omok game algorism
void Check_user(U08 countmax, U08 danger);	// check if user win
void Check_MCU(U08 countmax, U08 danger);	// check if MCU win

/* ---------------------------------------------------------------------------- */

#define	Xbase		0			// x base position of board
#define	Ybase		0			// y base position of board

#define White_stone	1 
#define Black_stone	2 

#define Left		0x01			// menu code of touch screen
#define Right		0x02
#define Down		0x03
#define Up		0x04
#define Enter		0x05
#define Clear		0x06

unsigned char cursor_x = 7, cursor_y = 7;	// cursor position
unsigned char cursor_x_old, cursor_y_old;
unsigned char game_over;			// game over flag
unsigned char beep_flag;			// beep on/off flag

unsigned char board[16][16];			// board data
unsigned char board_old[16][16];

unsigned char danger_MCU[16][16];		// MCU danger count
unsigned char danger_user[16][16]; 		// user danger count

/* ----- 인터럽트 처리 프로그램 ----------------------------------------------- */

volatile unsigned char count2Hz, second, minute;

void SysTick_Handler(void)			/* SysTick interrupt function by 2Hz */
{
  count2Hz++;
  if(count2Hz == 2)
    { count2Hz = 0;
      second++;					// increment second
      if(second == 60)				// if second = 60, second = 0
        { second = 0;
          minute++;				// increment minute
          if(minute == 60)			// if minute = 60, minute = 0
            minute = 0;
        }
    }
}

/* ----- 메인 프로그램 -------------------------------------------------------- */

int main(void)
{
  unsigned char key, exit;

  Initialize_MCU();				// initialize MCU and kit
  Delay_ms(50);					// wait for system stabilization
  Initialize_LCD();				// initialize text LCD module
  Initialize_TFT_LCD();				// initialize TFT-LCD module
  TFT_landscape_mode();				// landscape mode
  Initialize_touch_screen();			// initialize touch screen

  LCD_string(0x80," OK-STM767 V1.0 ");		// display title
  LCD_string(0xC0,"   Exp21_4.c    ");
  Beep();

  beep_flag = 1;				// beep on
  count2Hz = 0;					// initialize time
  second = 0;
  minute = 0;

  SysTick->LOAD  = 13499999;			// 27MHz/(13499999+1) = 2Hz
  SysTick->VAL   = 0;				// clear SysTick Counter
  SysTick->CTRL  = 0x00000003;			// 216MHz/8 = 27MHz, enable SysTick and interrupt

  while(1)
    { game_over = 0;				// initial game state
      exit = 0;
      second = 0;				// initialize time
      minute = 0;
      Initialize_board();			// initialize board
      Draw_control();				// draw control

      while(!exit) 
	{ Draw_board(); 			// draw board

          key = Icon_input();			// read touch screen icon
	  switch(key) 
	    { case Left:  if((game_over == 0) && (cursor_x != 0))  cursor_x--;
	                  break; 
	      case Right: if((game_over == 0) && (cursor_x != 15)) cursor_x++;
	                  break; 
	      case Down:  if((game_over == 0) && (cursor_y != 15)) cursor_y++;
	                  break; 
	      case Up:    if((game_over == 0) && (cursor_y != 0))  cursor_y--;
	                  break; 
	      case Enter: if((game_over == 0) && (board[cursor_y][cursor_x] == 0))
			    { board[cursor_y][cursor_x] = Black_stone;
			      Omok_game();	// omok game algorithm
			    }
                          else if((game_over == 0) && (board[cursor_y][cursor_x] != 0))
                            Beep_3times();
			  break; 
	      case Clear: exit = 1; 
		 	  break; 
	    }

          if(game_over == 0)
	    { Check_user(5,0);			// check if user win
	      Check_MCU(5,0);			// check if MCU win
            }

          if(game_over == 0)			// display time
            { TFT_color(White,Black);
              TFT_xy(35,1); TFT_unsigned_decimal(minute,1,2);
	      TFT_English(':');
	      TFT_xy(38,1); TFT_unsigned_decimal(second,1,2);
            }
	}
    }
}

/* ----- 사용자 정의 함수 ----------------------------------------------------- */

unsigned char icon_flag = 0;

unsigned char Icon_input(void)			/* input touch screen icon */
{
  unsigned char icon;

  Touch_screen_input();				// input touch screen

  if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (0, 0)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (1, 0)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (2, 0)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (3, 0)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (4, 0)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (5, 0)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (6, 0)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (7, 0)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (8, 0)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (9, 0)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (10, 0)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (11, 0)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (12, 0)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (13, 0)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (14, 0)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch > 0) && (y_touch <= 14))
    { icon = Enter;				// cursor = (15, 0)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 0;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (0, 1)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (1, 1)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (2, 1)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (3, 1)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (4, 1)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (5, 1)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (6, 1)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (7, 1)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (8, 1)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (9, 1)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (10, 1)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (11, 1)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (12, 1)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (13, 1)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (14, 1)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 15) && (y_touch <= 29))
    { icon = Enter;				// cursor = (15, 1)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 1;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (0, 2)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (1, 2)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (2, 2)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (3, 2)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (4, 2)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (5, 2)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (6, 2)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (7, 2)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (8, 2)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (9, 2)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (10, 2)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (11, 2)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (12, 2)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (13, 2)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (14, 2)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 30) && (y_touch <= 44))
    { icon = Enter;				// cursor = (15, 2)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 2;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (0, 3)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (1, 3)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (2, 3)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (3, 3)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (4, 3)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (5, 3)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (6, 3)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (7, 3)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (8, 3)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (9, 3)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (10, 3)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (11, 3)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (12, 3)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (13, 3)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (14, 3)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 45) && (y_touch <= 59))
    { icon = Enter;				// cursor = (15, 3)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 3;
      if(beep_flag == 1) Beep();
    }

