david15711/STM32workplace/Exp22_4_Omok_16x16.c
  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (0, 4)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (1, 4)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (2, 4)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (3, 4)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (4, 4)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (5, 4)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (6, 4)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (7, 4)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (8, 4)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (9, 4)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (10, 4)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (11, 4)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (12, 4)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (13, 4)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (14, 4)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 60) && (y_touch <= 74))
    { icon = Enter;				// cursor = (15, 4)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 4;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (0, 5)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (1, 5)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (2, 5)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (3, 5)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (4, 5)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (5, 5)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (6, 5)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (7, 5)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (8, 5)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (9, 5)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (10, 5)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (11, 5)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (12, 5)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (13, 5)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (14, 5)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 75) && (y_touch <= 89))
    { icon = Enter;				// cursor = (15, 5)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 5;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (0, 6)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (1, 6)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (2, 6)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (3, 6)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (4, 6)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (5, 6)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (6, 6)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (7, 6)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (8, 6)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (9, 6)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (10, 6)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (11, 6)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (12, 6)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (13, 6)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (14, 6)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 90) && (y_touch <= 104))
    { icon = Enter;				// cursor = (15, 6)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 6;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (0, 7)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (1, 7)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (2, 7)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (3, 7)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (4, 7)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (5, 7)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (6, 7)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (7, 7)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (8, 7)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (9, 7)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (10, 7)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (11, 7)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (12, 7)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (13, 7)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (14, 7)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 105) && (y_touch <= 119))
    { icon = Enter;				// cursor = (15, 7)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 7;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (0, 8)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (1, 8)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (2, 8)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (3, 8)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (4, 8)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (5, 8)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (6, 8)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (7, 8)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (8, 8)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (9, 8)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (10, 8)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (11, 8)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (12, 8)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (13, 8)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (14, 8)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 120) && (y_touch <= 134))
    { icon = Enter;				// cursor = (15, 8)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 8;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (0, 9)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (1, 9)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (2, 9)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (3, 9)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (4, 9)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (5, 9)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (6, 9)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (7, 9)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (8, 9)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (9, 9)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (10, 9)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (11, 9)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (12, 9)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (13, 9)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (14, 9)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 135) && (y_touch <= 149))
    { icon = Enter;				// cursor = (15, 9)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 9;
      if(beep_flag == 1) Beep();
    }

