david15711/STM32workplace/Exp22_4_Omok_16x16.c
  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (0, 10)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (1, 10)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (2, 10)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (3, 10)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (4, 10)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (5, 10)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (6, 10)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (7, 10)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (8, 10)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (9, 10)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (10, 10)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (11, 10)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (12, 10)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (13, 10)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (14, 10)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 150) && (y_touch <= 164))
    { icon = Enter;				// cursor = (15, 10)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 10;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (0, 11)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (1, 11)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (2, 11)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (3, 11)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (4, 11)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (5, 11)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (6, 11)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (7, 11)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (8, 11)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (9, 11)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (10, 11)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (11, 11)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (12, 11)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (13, 11)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (14, 11)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 165) && (y_touch <= 179))
    { icon = Enter;				// cursor = (15, 11)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 11;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (0, 12)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (1, 12)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (2, 12)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (3, 12)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (4, 12)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (5, 12)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (6, 12)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (7, 12)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (8, 12)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (9, 12)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (10, 12)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (11, 12)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (12, 12)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (13, 12)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (14, 12)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 180) && (y_touch <= 194))
    { icon = Enter;				// cursor = (15, 12)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 12;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (0, 13)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (1, 13)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (2, 13)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (3, 13)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (4, 13)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (5, 13)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (6, 13)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (7, 13)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (8, 13)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (9, 13)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (10, 13)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (11, 13)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (12, 13)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (13, 13)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (14, 13)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 195) && (y_touch <= 209))
    { icon = Enter;				// cursor = (15, 13)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 13;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (0, 14)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (1, 14)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (2, 14)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (3, 14)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (4, 14)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (5, 14)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (6, 14)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (7, 14)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (8, 14)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (9, 14)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (10, 14)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (11, 14)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (12, 14)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (13, 14)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (14, 14)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 210) && (y_touch <= 224))
    { icon = Enter;				// cursor = (15, 14)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 14;
      if(beep_flag == 1) Beep();
    }

