david15711/STM32workplace/Exp22_4_Omok_16x16.c
  else if((icon_flag == 0) && (x_touch > 0) && (x_touch <= 14) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (0, 15)
      icon_flag = 1;
      cursor_x = 0;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 15) && (x_touch <= 29) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (1, 15)
      icon_flag = 1;
      cursor_x = 1;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 30) && (x_touch <= 44) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (2, 15)
      icon_flag = 1;
      cursor_x = 2;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 59) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (3, 15)
      icon_flag = 1;
      cursor_x = 3;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 60) && (x_touch <= 74) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (4, 15)
      icon_flag = 1;
      cursor_x = 4;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 75) && (x_touch <= 89) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (5, 15)
      icon_flag = 1;
      cursor_x = 5;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 90) && (x_touch <= 104) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (6, 15)
      icon_flag = 1;
      cursor_x = 6;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 105) && (x_touch <= 119) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (7, 15)
      icon_flag = 1;
      cursor_x = 7;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 120) && (x_touch <= 134) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (8, 15)
      icon_flag = 1;
      cursor_x = 8;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 135) && (x_touch <= 149) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (9, 15)
      icon_flag = 1;
      cursor_x = 9;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 150) && (x_touch <= 164) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (10, 15)
      icon_flag = 1;
      cursor_x = 10;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 165) && (x_touch <= 179) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (11, 15)
      icon_flag = 1;
      cursor_x = 11;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 180) && (x_touch <= 194) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (12, 13)
      icon_flag = 1;
      cursor_x = 12;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 195) && (x_touch <= 209) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (13, 15)
      icon_flag = 1;
      cursor_x = 13;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 210) && (x_touch <= 224) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (14, 15)
      icon_flag = 1;
      cursor_x = 14;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 225) && (x_touch <= 239) && (y_touch >= 225) && (y_touch <= 239))
    { icon = Enter;				// cursor = (15, 15)
      icon_flag = 1;
      cursor_x = 15;
      cursor_y = 15;
      if(beep_flag == 1) Beep();
    }

  else if((icon_flag == 0) && (x_touch >= 260) && (x_touch <= 307) && (y_touch >= 36) && (y_touch <= 58))
    { icon = Clear;				// clear game
      icon_flag = 1;
      Draw_cleargame(Magenta, Magenta);
      if(beep_flag == 1) Beep();
      Delay_ms(200);
    }
  else if((icon_flag == 0) && (x_touch >= 248) && (x_touch <= 319) && (y_touch >= 72) && (y_touch <= 89))
    { icon = no_key;				// beep on/off
      icon_flag = 1;
      Beep();
      if(beep_flag == 0)
        { beep_flag = 1;
	  TFT_string(37,9,Red,Cyan," ON");
        }
      else
        { beep_flag = 0;
	  TFT_string(37,9,Red,Cyan,"OFF");
        }
    }
  else if((icon_flag == 0) && (x_touch >= 247) && (x_touch <= 270) && (y_touch >= 143) && (y_touch <= 163))
    { icon = Left;				// left
      icon_flag = 1;
      Draw_left(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 296) && (x_touch <= 319) && (y_touch >= 143) && (y_touch <= 163))
    { icon = Right;				// right
      icon_flag = 1;
      Draw_right(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 273) && (x_touch <= 293) && (y_touch >= 117) && (y_touch <= 140))
    { icon = Up;				// up
      icon_flag = 1;
      Draw_up(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 273) && (x_touch <= 293) && (y_touch >= 166) && (y_touch <= 189))
    { icon = Down;				// down
      icon_flag = 1;
      Draw_down(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 260) && (x_touch <= 307) && (y_touch >= 204) && (y_touch <= 226))
    { icon = Enter;				// stone enter
      icon_flag = 1;
      Draw_enter(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 1) && (x_touch == 0) && (y_touch == 0))
    { icon = no_key;
      icon_flag = 0;
      Draw_cleargame(White, Yellow);
      Draw_left(White, Cyan);
      Draw_right(White, Cyan);
      Draw_up(White, Cyan);
      Draw_down(White, Cyan);
      Draw_enter(White, Cyan);
      Delay_ms(50);
    }
  else
    icon = no_key;

