david15711/STM32workplace/Exp22_4_Omok_16x16.c
  return icon;
}

void Initialize_board(void)			/* initialize board */
{
  unsigned char x, y;

  cursor_x = 7;					// initial cursor position
  cursor_y = 7;

  for(y = 0 ; y < 16; y++)			// clear board
    { for(x = 0; x < 16; x++)
        { board_old[y][x] = 0xFF;
	  board[y][x] =  0; 
	  danger_MCU[y][x] = 0; 
	  danger_user[y][x] = 0;
	}
    }
}

const unsigned short symbol[11][15] =
 {{ 0x0000,0x0380,0x0FE0,0x1FF0,0x3FF8,0x3FF8,0x7FFC,0x7FFC,0x7FFC,0x3FF8,0x3FF8,0x1FF0,0x0FE0,0x0380,0x0000 },	// (0) stone 
  { 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x01FE,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (1) "┌" 
  { 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0xFF00,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (2) "┐" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x01FE,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 },	// (3) "└" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0xFF00,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 },	// (4) "┘" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x01FE,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (5) "├" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0xFF00,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (6) "┤" 
  { 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0xFFFE,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (7) "┬" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0xFFFE,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 },	// (8) "┴" 
  { 0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0xFFFE,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100,0x0100 },	// (9) "┼" 
  { 0xC006,0xE00E,0x701C,0x3838,0x1C70,0x0EE0,0x07C0,0x0380,0x07C0,0x0EE0,0x1C70,0x3838,0x701C,0xE00E,0xC006 }};// (10) cursor

void Draw_symbol(U08 xPos,U08 yPos, U16 color, U08 code)	/* draw cross of board */
{
  unsigned char  x, y;
  unsigned short font, cursor_font;

  for(y = 0; y < 15; y++)
    { TFT_GRAM_address(Xbase+(xPos*15),Ybase+(yPos*15)+y);
      font = symbol[code][y];
      cursor_font = symbol[10][y];
      for(x = 0; x < 15; x++)
        { if((cursor_x == xPos) && (cursor_y == yPos) && ((cursor_font << x) & 0x8000))
	    TFT_data(Red); 
          else if((font << x) & 0x8000)
	    TFT_data(color);
  	  else
	    TFT_data(Orange);
	}
    }
}

void Draw_board(void)				/* draw board */ 
{ 
  unsigned char x, y; 

  for(y = 0; y < 16; y++) 
    { for(x = 0; x < 16; x++) 
	{ if((board[y][x] != board_old[y][x]) || (cursor_x_old == x && cursor_y_old == y))
	    { board_old[y][x] = board[y][x];
	      if(board[y][x] == White_stone)	// draw white stone
	        Draw_symbol(x,y, White, 0);	
	      else if(board[y][x] == Black_stone) // draw black stone
	        Draw_symbol(x,y, Black, 0);	
	      else 				// draw cross line
		{ if(x == 0 && y == 0)                   Draw_symbol(x,y,Black,1); // "┌" 
		  else if(x == 15 && y == 0)             Draw_symbol(x,y,Black,2); // "┐" 
		  else if(x == 0  && y == 15)            Draw_symbol(x,y,Black,3); // "└" 
		  else if(x == 15 && y == 15)            Draw_symbol(x,y,Black,4); // "┘" 
		  else if(x == 0  && y != 0  && y != 15) Draw_symbol(x,y,Black,5); // "├" 
		  else if(x == 15 && y != 0  && y != 15) Draw_symbol(x,y,Black,6); // "┤" 
		  else if(x != 0  && x != 15 && y == 0)  Draw_symbol(x,y,Black,7); // "┬" 
		  else if(x != 0  && x != 15 && y == 15) Draw_symbol(x,y,Black,8); // "┴" 
		  else                                   Draw_symbol(x,y,Black,9); // "┼" 
		} 
	    }
	}
    } 

  cursor_x_old = cursor_x;
  cursor_y_old = cursor_y;
}

void Draw_control(void)				/* draw game control */
{
  TFT_string( 0,30,Green,Black, "(MCU = White)");
  TFT_string(17,30,Green,Black, "(You = Black)");

  Draw_cleargame(White, Yellow);		// display clear for new game

  Draw_left(White, Cyan);			// display arrow for touch screen
  Draw_right(White, Cyan);
  Draw_up(White, Cyan);
  Draw_down(White, Cyan);

  Draw_enter(White, Cyan);			// display stone enter

  TFT_string(31,1,Magenta,Black,"시간00:00");	// display time

  TFT_string(31,9,Black,Cyan,"효과음");		// beep on/off
  if(beep_flag == 1)
    TFT_string(37,9,Red,Cyan," ON");
  else
    TFT_string(37,9,Red,Cyan,"OFF");
}

void Draw_cleargame(U16 color1, U16 color2)	/* display clear game for touch screen */
{
  Rectangle(260,36, 307,58, color1);
  TFT_string(33,5, color2,Black, "CLEAR");
}

void Draw_left(U16 color1, U16 color2)		/* display left arrow for touch screen */
{
  Rectangle(247,143, 270,163, color1);
  Draw_arrow(251, 145, color2, 0);
}

void Draw_right(U16 color1, U16 color2)		/* display right arrow for touch screen */
{
  Rectangle(296,143, 319,163, color1);
  Draw_arrow(300, 145, color2, 1);
}

void Draw_up(U16 color1, U16 color2)		/* display up arrow for touch screen */
{
  Rectangle(273,117, 293,140, color1);
  Draw_arrow(276, 121, color2, 2);
}

void Draw_down(U16 color1, U16 color2)		/* display down arrow for touch screen */
{
  Rectangle(273,166, 293,189, color1);
  Draw_arrow(276, 170, color2, 3);
}

void Draw_enter(U16 color1, U16 color2)		/* display stone enter for touch screen */
{
  Rectangle(260,204, 307,226, color1);
  TFT_string(33,26, color2,Black, "ENTER");
}

const unsigned short Arrow[4][16] = {				/* 16x16 arrow */
 { 0x0000,0x0100,0x0300,0x0700,0x0F00,0x1F00,0x3FFF,0x7FFF,	// (0) left arrow
   0xFFFF,0x7FFF,0x3FFF,0x1F00,0x0F00,0x0700,0x0300,0x0100 },
 { 0x0000,0x0080,0x00C0,0x00E0,0x00F0,0x00F8,0xFFFC,0xFFFE,	// (1) right arrow
   0xFFFF,0xFFFE,0xFFFC,0x00F8,0x00F0,0x00E0,0x00C0,0x0080 },
 { 0x0100,0x0380,0x07C0,0x0FE0,0x1FF0,0x3FF8,0x7FFC,0xFFFE,	// (2) up arrow
   0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0 },
 { 0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,0x07C0,	// (3) down arrow
   0xFFFE,0x7FFC,0x3FF8,0x1FF0,0x0FE0,0x07C0,0x0380,0x0100 }};

void Draw_arrow(U16 xPos,U16 yPos, U16 color, U08 code)	/* draw arrow for touch screen */
{
  unsigned char  x, y;
  unsigned short font;

  for(y = 0; y < 16; y++)
    { TFT_GRAM_address(xPos,yPos+y);
      font = Arrow[code][y];
      for(x = 0; x < 16; x++)
        { if((font << x) & 0x8000) TFT_data(color);	
	  else                     TFT_data(Black);
	}
    }
}

/* ----- 게임 알고리즘 함수 --------------------------------------------------- */

