david15711/STM32workplace/Exp22_4_Omok_16x16.c
void Omok_game(void)				/* omok game algorism */
{
  unsigned char x, y; 
  unsigned char max_danger_value = 0, max_attack_value = 0; 
  unsigned char max_danger_x = 0, max_danger_y = 0; 
  unsigned char max_attack_x = 0, max_attack_y = 0; 

  for(y = 0; y < 16; y++)			// 위험도 초기화 
    for(x = 0; x < 16; x++)
      { danger_MCU[y][x] = 0; 
        danger_user[y][x] = 0; 
      } 

  for(y = 0; y < 16; y++)			// 상,하,좌,우,대각선 방향의 위험도
    for(x = 0; x < 16; x++)
      { if(board[y][x] == Black_stone) 
	  { if(x > 0)  if(board[y][x-1] == 0) danger_MCU[y][x-1]++; 
	    if(x < 15) if(board[y][x+1] == 0) danger_MCU[y][x+1]++; 
	    if(y > 0)  if(board[y-1][x] == 0) danger_MCU[y-1][x]++; 
	    if(y < 15) if(board[y+1][x] == 0) danger_MCU[y+1][x]++; 

	    if(y > 0 && x > 0)   if(board[y-1][x-1] == 0) danger_MCU[y-1][x-1]++; 
	    if(y > 0 && x < 15)  if(board[y-1][x+1] == 0) danger_MCU[y-1][x+1]++; 
	    if(y < 15 && x > 0)  if(board[y+1][x-1] == 0) danger_MCU[y+1][x-1]++; 
	    if(y < 15 && x < 15) if(board[y+1][x+1] == 0) danger_MCU[y+1][x+1]++; 
	  } 
      } 

  Check_user(4,10);				// check user
  Check_user(3,7); 
  Check_user(2,5); 
  Check_MCU(4,10);				// check MCU
  Check_MCU(3,7); 
  Check_MCU(2,5); 

  for(y = 0; y < 16; y++)			// 최고 위험지역 검색
    for(x = 0; x < 16; x++)
      { if(danger_MCU[y][x] > max_danger_value) 
	  { if(board[y][x] == 0) 
	      { max_danger_value = danger_MCU[y][x]; 
	        max_danger_x = x; 
	        max_danger_y = y; 
	      } 
	  } 
      } 

  for(y = 0; y < 16; y++)			// 최고 공격지역 검색
    for(x = 0; x < 16; x++)
      { if(danger_user[y][x] > max_attack_value) 
          { if(board[y][x] == 0) 
	      { max_attack_value = danger_user[y][x]; 
	        max_attack_x = x; 
	        max_attack_y = y; 
	      } 
	  } 
      }

  if(max_danger_value > max_attack_value)	// 최고 위험지역과 최고 공격지역의 수치중 높은 곳을 선택
    { board[max_danger_y][max_danger_x] = White_stone; 
      cursor_x = max_danger_x; 
      cursor_y = max_danger_y; 
    }
  else
    { board[max_attack_y][max_attack_x] = White_stone; 
      cursor_x = max_attack_x; 
      cursor_y = max_attack_y; 
    }
}

void Check_user(U08 countmax, U08 danger)	/* check if user win */
{ 
  unsigned char x, y, i; 
  unsigned char count = 0;			// 돌 갯수를 세는 변수 
  unsigned char count2 = 0;			// 양쪽 모두 비어있는지 검사용 

  for(y = 0; y < 16; y++)			// ***** 가로 방향 검사
    { for(x = 0; x < 16-countmax; x++)
	{ for(i = x; i < x+countmax; i++)
	    if(board[y][i] == Black_stone) count++; // 돌 갯수 검사 
	  if(count >= countmax)
	    { if(countmax >= 5)			// 5개가 연결되면 게임 끝 
		{ TFT_string(1,1,White,Blue, " You win.  Congratulation ! ");
		  game_over = 1; 
                  if(beep_flag == 1) Beep_3times();
		  return;
		} 

	      if(x > 0)               danger_MCU[y][x-1] += danger; 
	      if(x+(countmax-1) < 15) danger_MCU[y][x+(countmax-1)+1] += danger; // 위험값을 추가

	      if(board[y][x-1] == 0)              count2++; 
	      if(board[y][x+(countmax-1)+1] == 0) count2++; 

	      if(count2 >= 2)			// 만약에 양쪽이 전부 비어있으면 위험값의 50%를 추가 
	        { if(x > 0)               danger_MCU[y][x-1] += danger/2; 
	          if(x+(countmax-1) < 15) danger_MCU[y][x+(countmax-1)+1] += danger/2; 
	        } 
	      else if(count2 >= 1)		// 한쪽만 비어있으면 위험값의 25%를 추가 
	        { if(x > 0)               danger_MCU[y][x-1] += danger/4; 
	          if(x+(countmax-1) < 15) danger_MCU[y][x+(countmax-1)+1] += danger/4; 
	        } 
	      count2 = 0; 
	    } 
          if(countmax == 4 && count == 3)	// 4개를 체크했는데 한칸 띄고 3개가 있으면
	    { for(i = x; i < x+countmax; i++)
	        { if(board[y][i] == 0 && i > x && i < x+countmax-1) // 빈곳이면서 사이에 들어있으면
		    danger_MCU[y][i] += danger/2;	// 위험값의 50%를 추가 
	        } 
	    } 
          count = 0; 
        } 
    } 
  count = 0; 
  count2 = 0; 

  for(y = 0; y < 16-countmax; y++)		// ***** 세로 방향 검사
    { for(x = 0; x < 16; x++)
	{ for(i = y; i < y+countmax; i++)
	    if(board[i][x] == Black_stone) count++; // 돌 갯수 검사 
	  if(count >= countmax)
	    { if(countmax >= 5)			// 5개가 연결되면 게임 끝 
		{ TFT_string(1,1,White,Blue, " You win.  Congratulation ! ");
		  game_over = 1; 
                  if(beep_flag == 1) Beep_3times();
		  return;
		} 

	      if(y > 0)               danger_MCU[y-1][x] += danger; 
	      if(y+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x]+=danger; // 위험값을 추가

	      if(board[y-1][x] == 0)              count2++; 
	      if(board[y+(countmax-1)+1][x] == 0) count2++; 

	      if(count2 >= 2)			// 만약에 양쪽이 전부 비어있으면 위험값의 50%를 추가 
		{ if(y > 0)               danger_MCU[y-1][x] += danger/2; 
		  if(y+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x] += danger/2; 
		} 
	      else if(count2 >= 1)		// 한쪽만 비어있으면 위험값의 25%를 추가 
		{ if(y > 0)               danger_MCU[y-1][x] += danger/4; 
		  if(y+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x] += danger/4; 
		} 
	      count2 = 0; 
	    } 
	  if(countmax == 4 && count == 3)	// 4개를 체크했는데 한칸 띄고 3개가 있으면
	    { for(i = y; i < y+countmax; i++)
		{ if(board[i][x] == 0 && i > y && i < y+countmax-1) // 빈곳이면서 사이에 들어있으면
		    danger_MCU[i][x] += danger/2;	// 위험값의 50%를 추가 
		} 
	    } 
	  count = 0; 
	} 
    } 
  count = 0; 
  count2 = 0; 

  for(y = 0; y < 16-countmax; y++)		// ***** 대각선 ＼ 방향 검사
    { for(x = 0; x < 16-countmax; x++)
	{ for(i = 0; i < countmax; i++)
	    if(board[y+i][x+i] == Black_stone) count++; // 돌 갯수 검사 
	  if(count >= countmax)
	    { if(countmax >= 5)			// 5개가 연결되면 게임 끝 
		{ TFT_string(1,1,White,Blue, " You win.  Congratulation ! ");
		  game_over = 1; 
                  if(beep_flag == 1) Beep_3times();
		  return;
		} 

	      if(x > 0 && y > 0)                             danger_MCU[y-1][x-1]+=danger; 
	      if(y+(countmax-1) < 15 && x+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x+(countmax-1)+1] += danger; 

	      if(board[y-1][x-1] == 0)                           count2++; 
	      if(board[y+(countmax-1)+1][x+(countmax-1)+1] == 0) count2++; 

	      if(count2 >= 2)			// 만약에 양쪽이 전부 비어있으면 위험값의 50%를 추가 
	        { if(x > 0 && y > 0)                             danger_MCU[y-1][x-1] += danger/2; 
	          if(y+(countmax-1) < 15 && x+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x+(countmax-1)+1] += danger/2; 
	        } 
	      else if(count2 >= 1)		// 한쪽만 비어있으면 위험값의 25%를 추가 
	        { if(x > 0 && y > 0)                             danger_MCU[y-1][x-1] += danger/4; 
	 	  if(y+(countmax-1) < 15 && x+(countmax-1) < 15) danger_MCU[y+(countmax-1)+1][x+(countmax-1)+1] += danger/4; 
	        } 
	      count2 = 0; 
	    } 
	  if(countmax == 4 && count == 3)	// 4개를 체크했는데 한칸 띄고 3개가 있으면
	    { for(i = 0; i < countmax; i++)
		{ if(board[y+i][x+i] == 0 && i > 0 && i < countmax-1) // 빈곳이면서 사이에 들어있으면
		    danger_MCU[y+i][x+i] += danger/2; // 위험값의 50%를 추가 
		} 
	    } 
	  count = 0; 
	} 
    } 
  count = 0; 
  count2 = 0; 

  for(y = 0; y < 16-countmax; y++)		// ***** 대각선 / 방향 검사
    { for(x = (countmax-1); x < 16; x++)
	{ for(i = 0; i < countmax; i++)
	    if(board[y+i][x-i] == Black_stone) count++; // 돌 갯수 검사 
	  if(count >= countmax)
	    { if(countmax >= 5)			// 5개가 연결되면 게임 끝 
		{ TFT_string(1,1,White,Blue, " You win.  Congratulation ! ");
		  game_over = 1; 
                  if(beep_flag == 1) Beep_3times();
		  return;
		} 

	      if(x+1 < 15 && y > 0)                         danger_MCU[y-1][x+1] += danger; 
	      if(y+(countmax-1) < 15 && x-(countmax-1) > 0) danger_MCU[y+(countmax-1)+1][x-(countmax-1)-1] += danger; 

	      if(board[y-1][x+1] == 0)                           count2++; 
	      if(board[y+(countmax-1)+1][x-(countmax-1)-1] == 0) count2++; 

	      if(count2 >= 2)			// 만약에 양쪽이 전부 비어있으면 위험값의 50%를 추가 
		{ if(x+1 < 15 && y > 0)                         danger_MCU[y-1][x+1] += danger/2; 
		  if(y+(countmax-1) < 15 && x-(countmax-1) > 0) danger_MCU[y+(countmax-1)+1][x-(countmax-1)-1] += danger/2; 
		} 
	      else if(count2 >= 1)		// 한쪽만 비어있으면 위험값의 25%를 추가 
		{ if(x+1 < 15 && y > 0)                         danger_MCU[y-1][x+1] += danger/4; 
		  if(y+(countmax-1) < 15 && x-(countmax-1) > 0) danger_MCU[y+(countmax-1)+1][x-(countmax-1)-1] += danger/4; 
		} 
	      count2 = 0; 
	    } 
	  if(countmax == 4 && count == 3)	// 4개를 체크했는데 한칸 띄고 3개가 있으면
	    { for(i = 0; i < countmax; i++)
		{ if(board[y+i][x-i] == 0 && i > 0 && i < countmax-1) // 빈곳이면서 사이에 들어있으면
		    danger_MCU[y+i][x-i] += danger/2; // 위험값의 50%를 추가 
		} 
	    } 
	  count = 0; 
	} 
    } 
  count = 0; 
  count2 = 0; 
} 

